Flow Diagran.md
```mermaid
erDiagram
    Admin_Account ||--|| Employee_Account : manages
    Guest_Account }|--|| Inventory : creates
    Coffee_Category ||--|| Inventory : tracks

    Admin_Account {
        int admin_id PK
        string admin_fullname
        string admin_username
        string admin_password
    }

    Employee_Account {
        int employee_id PK
        string employee_fullname
        string employee_username
        string employee_password
    }

    Guest_Account {
        int guest_id PK
        string guest_fullname
        string guest_username
        string guest_password
    }

    Coffee_Category {
        int coffee_id PK
        string coffee_name
        string type
        int discount
        int in_stock
        int coffee_price
    }

    Inventory {
        string bill_number PK
        string date
        string cashier_name
        int contact
        string bill_details
    }
```
